# Feature Construction:
    It is technique in which we create new feature from the given features

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import cross_val_score

In [2]:
df=pd.read_csv("//Users//udayladdha//Desktop//DataSets//train.csv")[["Age","Pclass","SibSp","Parch","Survived"]]
df.head()

    Age  Pclass  SibSp  Parch  Survived
0  22.0       3      1      0         0
1  38.0       1      1      0         1
2  26.0       3      0      0         1
3  35.0       1      1      0         1
4  35.0       3      0      0         0

In [3]:
df.isnull().sum()

Age         177
Pclass        0
SibSp         0
Parch         0
Survived      0
dtype: int64

In [4]:
df.dropna(inplace=True)

In [5]:
df.isnull().sum()

Age         0
Pclass      0
SibSp       0
Parch       0
Survived    0
dtype: int64

In [6]:
x=df.iloc[:,0:4]
y=df.iloc[:,-1]

In [7]:
np.mean(cross_val_score(LogisticRegression(),x,y,scoring="accuracy",cv=20))

0.6933333333333332

# Applying feature construction

In [8]:
x["Family_size"]=x["Parch"]+x["SibSp"]+1   # here we added 1 because we are also including the passenger

In [9]:
x.head(8)

    Age  Pclass  SibSp  Parch  Family_size
0  22.0       3      1      0            2
1  38.0       1      1      0            2
2  26.0       3      0      0            1
3  35.0       1      1      0            2
4  35.0       3      0      0            1
6  54.0       1      0      0            1
7   2.0       3      3      1            5
8  27.0       3      0      2            3

In [10]:
def myfunc(num):
    if num==1:
        return 0 # passenger is travelling alone with no family members
    elif num>1 and num<=4:
        return 1 # passenger is traveliing with atleasts 4 members
    else:
        return 2 # passenger is travelling with more than 4 persons

In [11]:
myfunc(3)

1

In [12]:
x["Family_type"]=x["Family_size"].apply(myfunc) # 0 = only 1 person passenger, 1= there are atleast 4 people including passenger, 2 = there are more than 4 people including passenger

In [13]:
x.head(10)

     Age  Pclass  SibSp  Parch  Family_size  Family_type
0   22.0       3      1      0            2            1
1   38.0       1      1      0            2            1
2   26.0       3      0      0            1            0
3   35.0       1      1      0            2            1
4   35.0       3      0      0            1            0
6   54.0       1      0      0            1            0
7    2.0       3      3      1            5            2
8   27.0       3      0      2            3            1
9   14.0       2      1      0            2            1
10   4.0       3      1      1            3            1

In [14]:
x.drop(columns=["Parch","SibSp","Family_size"],inplace=True)

In [15]:
np.mean(cross_val_score(LogisticRegression(),x,y,scoring="accuracy",cv=20)) # after doing feature construction our accuracy got increased

0.7003174603174602

# Feature Splitting

In [16]:
df=pd.read_csv("//Users//udayladdha//Desktop//DataSets//train.csv")

In [17]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
df["Name"] # as we can see first sirname is given then the salutation then the name

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [19]:
# we will split the salution form the given name

In [23]:
df["Title"]=df["Name"].str.split(",",expand=True)[1].str.split(".",expand=False)[0] # splitting the title from the name coloumn

AttributeError: 'list' object has no attribute 'str'

In [21]:
df[["Title","Name"]]

     Title                                               Name
0       Mr                            Braund, Mr. Owen Harris
1      Mrs  Cumings, Mrs. John Bradley (Florence Briggs Th...
2     Miss                             Heikkinen, Miss. Laina
3      Mrs       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4       Mr                           Allen, Mr. William Henry
..     ...                                                ...
886    Rev                              Montvila, Rev. Juozas
887   Miss                       Graham, Miss. Margaret Edith
888   Miss           Johnston, Miss. Catherine Helen "Carrie"
889     Mr                              Behr, Mr. Karl Howell
890     Mr                                Dooley, Mr. Patrick

[891 rows x 2 columns]

In [22]:
((df.groupby("Title").mean()["Survived"]).sort_values(ascending=False))*100 # percentage of people who survived according to their title

/var/folders/s4/ml_p60116zjb00n_yp90k4r80000gn/T/ipykernel_8475/233458596.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  ((df.groupby("Title").mean()["Survived"]).sort_values(ascending=False))*100 # percentage of people who survived according to their title

Title
 the Countess    100.000000
 Mlle            100.000000
 Sir             100.000000
 Ms              100.000000
 Lady            100.000000
 Mme             100.000000
 Mrs              79.200000
 Miss             69.780220
 Master           57.500000
 Col              50.000000
 Major            50.000000
 Dr               42.857143
 Mr               15.667311
 Jonkheer          0.000000
 Rev               0.000000
 Don               0.000000
 Capt              0.000000
Name: Survived, dtype: float64